{
  "displayName": "CA406-TruesecSOC-IdentityProtection-AllApps-AnyPlatform-CompliantAndPhishResistantMFA",
  "state": "disabled",
  "conditions": {
    "users": {
      "includeGuestsOrExternalUsers": {
        "guestOrExternalUserTypes": "b2bCollaborationGuest",
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessEnumeratedExternalTenants",
          "membershipKind": "enumerated",
          "members": [ "07d2f395-f69c-43ab-88a2-b82f1151042d" ]
        }
      }
    },
    "applications": {
      "includeApplications": [ "All" ]
    },
    "platforms": {
      "includePlatforms": [ "all" ]
    },
    "clientAppTypes": [ "all" ]
  },
  "grantControls": {
    "operator": "AND",
    "builtInControls": [ "compliantDevice" ],
    "authenticationStrength": {
      "id": "00000000-0000-0000-0000-000000000004"
    }
  }
}